src/InformationRegisters/ДинамическиеЦеныНоменклатуры/ДинамическиеЦеныНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДинамическиеЦеныНоменклатуры</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Цена</name>
    <type>
      <types>CatalogRef.ПорогиДинамическихЦен</types>
    </type>
  </resources>
  <resources>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/КурсыВалют/КурсыВалют.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КурсыВалют</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Курс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Кратность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/ЦеныНоменклатуры/ЦеныНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЦеныНоменклатуры</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </resources>
  <resources>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ТипЦен</name>
    <type>
      <types>CatalogRef.ТипыЦенНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Спецификация</name>
    <type>
      <types>CatalogRef.Спецификации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Catalogs/ПорогиДинамическихЦен/ПорогиДинамическихЦен.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПорогиДинамическихЦен</name>
  <tabularSections>
    <name>Пороги</name>
    <attributes>
      <name>От</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>До</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/CommonModules/Ценообразование/Module.bsl
Функция ПолучитьДинамическуюЦену(Дата,Номенклатура,Показатель) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаНоменклатура.Ссылка КАК Номенклатура,
	|	ДинамическиеЦеныНоменклатурыСрезПоследних.Цена,
	|	ДинамическиеЦеныНоменклатурыСрезПоследних.Валюта
	|ПОМЕСТИТЬ ВТЦены
	|ИЗ
	|	Справочник.Номенклатура КАК ТаблицаНоменклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДинамическиеЦеныНоменклатуры.СрезПоследних(&ТекДата, ) КАК ДинамическиеЦеныНоменклатурыСрезПоследних
	|		ПО ТаблицаНоменклатура.Ссылка = ДинамическиеЦеныНоменклатурыСрезПоследних.Номенклатура
	|ГДЕ
	|	ТаблицаНоменклатура.Ссылка = &Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТЦены.Номенклатура,
	|	ПорогиДинамическихЦенПороги.Цена,
	|	ВТЦены.Валюта,
	|	КурсыВалютСрезПоследних.Курс,
	|	КурсыВалютСрезПоследних.Кратность
	|ИЗ
	|	ВТЦены КАК ВТЦены
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПорогиДинамическихЦен.Пороги КАК ПорогиДинамическихЦенПороги
	|		ПО ВТЦены.Цена = ПорогиДинамическихЦенПороги.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&ТекДата, ) КАК КурсыВалютСрезПоследних
	|		ПО ВТЦены.Валюта = КурсыВалютСрезПоследних.Валюта
	|ГДЕ
	|	ВЫБОР
	|			КОГДА ПорогиДинамическихЦенПороги.До = 0
	|				ТОГДА &х > ПорогиДинамическихЦенПороги.От
	|			ИНАЧЕ &х > ПорогиДинамическихЦенПороги.От
	|					И &х < ПорогиДинамическихЦенПороги.До
	|		КОНЕЦ";
	
	Запрос.УстановитьПараметр("Номенклатура",Номенклатура);
	Запрос.УстановитьПараметр("ТекДата",КонецДня(Дата));
	Запрос.УстановитьПараметр("х",Показатель);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Цена = РаботаСКурсамиВалютКлиентСервер.ПересчитатьПоКурсу(
		Выборка.Цена, 
		Новый Структура("Валюта, Курс, Кратность", Выборка.Валюта, Выборка.Курс, Выборка.Кратность),
		Новый Структура("Валюта, Курс, Кратность", Константы.ВалютаРегламентированногоУчета.Получить(), 1, 1));
		
		Возврат Цена;
	Иначе
		Возврат 0;
	КонецЕсли; 
	
	
КонецФункции  


Функция ПолучитьЦену(Номенклатура,Спецификация) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЦеныНоменклатурыСрезПоследних.Цена,
	|	ЦеныНоменклатурыСрезПоследних.Валюта,
	|	КурсыВалютСрезПоследних.Курс,
	|	КурсыВалютСрезПоследних.Кратность
	|ИЗ
	|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	|			&ТекДата,
	|			Номенклатура = &Номенклатура
	|				И Спецификация = &Спецификация) КАК ЦеныНоменклатурыСрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&ТекДата, ) КАК КурсыВалютСрезПоследних
	|		ПО ЦеныНоменклатурыСрезПоследних.Валюта = КурсыВалютСрезПоследних.Валюта";
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Спецификация", Спецификация);
	Запрос.УстановитьПараметр("ТекДата", ТекущаяДата());
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Цена = РаботаСКурсамиВалютКлиентСервер.ПересчитатьПоКурсу(
		Выборка.Цена, 
		Новый Структура("Валюта, Курс, Кратность", Выборка.Валюта, Выборка.Курс, Выборка.Кратность),
		Новый Структура("Валюта, Курс, Кратность", Константы.ВалютаРегламентированногоУчета.Получить(), 1, 1));
		
		Возврат Цена;
	Иначе
		Возврат 0;
	КонецЕсли; 
	
КонецФункции
